# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],   #二倍降采样  B,64,H/2,W/2

   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  #四倍降采样 B,128,H/4,W/4

   [-1, 1, ResNet_ACmix, [128, 128]],
   

   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, RepACmixblock, [64, 3, 1]],
   [-1, 1, RepACmixblock, [64, 3, 1]],
   [-1, 1, RepACmixblock, [64, 3, 1]],
   [-1, 1, RepACmixblock, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 12  第一个ELAN模块结构  B,256,H/4,W/4

   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],  #MP-1X1  = B,128,H/8,W/8
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],  #1X1-3X3  = B,128,H/8,W/8
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8   八倍降采样   B,256,H/8,W/8

   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, RepACmixblock, [128, 3, 1]],
   [-1, 1, RepACmixblock, [128, 3, 1]],
   [-1, 1, RepACmixblock, [128, 3, 1]],
   [-1, 1, RepACmixblock, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 25   第二个ELAN模块结构  B,512,H/8,W/8

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 30-P4/16  十六倍降采样  B,512,H/16,W/16

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, RepACmixblock, [256, 3, 1]],
   [-1, 1, RepACmixblock, [256, 3, 1]],
   [-1, 1, RepACmixblock, [256, 3, 1]],
   [-1, 1, RepACmixblock, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 38   第三个ELAN模块结构  B,1024,H/16,W/16

   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 43-P5/32  三十二倍降采样 B,1024,H/32,W/32

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, RepACmixblock, [256, 3, 1]],
   [-1, 1, RepACmixblock, [256, 3, 1]],
   [-1, 1, RepACmixblock, [256, 3, 1]],
   [-1, 1, RepACmixblock, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 51  第四个ELAN模块结构  B,1024,H/32,W/32
  
   [-1, 1, ResNet_ACmix, [1024, 1024]],
   [-1, 1, GAM_Attention, [1024]],
  
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 54  B,512,H/32,W/32

   [-1, 1, Conv, [256, 1, 1]],   # B,256,H/32,W/32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 二倍上采样   B,256,H/16,W/16
   [38, 1, Conv, [256, 1, 1]], # route backbone P4  第三个ELAN模块结构后面接一个卷积操作 B,256,H/16,W/16
   
   [-1, 1, GAM_Attention, [256]],
   
   [[-1, -3], 1, Concat, [1]],  # 前俩层拼接 B,512,H/16,W/16

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],  #第一个E-ELAN模块结构 B,1024,H/16,W/16

   [-1, 1, Conv, [256, 1, 1]], # 67     B,256,H/16,W/16

   [-1, 1, Conv, [128, 1, 1]],   # B,128,H/16,W/16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #二倍上采样 B,128,H/8,W/8
   [25, 1, Conv, [128, 1, 1]], # route backbone P3   第二个ELAN模块结构  B,512,H/8,W/8 变成 B,128,H/8,W/8
   
   [-1, 1, GAM_Attention, [128]],
   
   [[-1, -3], 1, Concat, [1]],   #拼接 B,256,H/8,W/8

   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],   #第二个E-ELAN模块结构 B,512,H/8,W/8
   
   [-1, 1, GAM_Attention, [512]],

   [-2, 1, Conv, [128, 1, 1]], # 81  #第一个检测 B,128,H/8,W/8

   [-1, 1, MP, []],   # B,128,H/16,W/16
   [-1, 1, Conv, [128, 1, 1]], # B,128,H/16,W/16
   [-3, 1, Conv, [128, 1, 1]], # B,128,H/8,W/8
   [-1, 1, Conv, [128, 3, 2]],  # B,128,H/16,W/16
   [[-1, -3, 67], 1, Concat, [1]],  #一起CAT B,128,H/16,W/16 和 B,128,H/16,W/16 和 B,256,H/16,W/16一起拼接成 B,512,H/16,W/16

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],  #第三个E-ELAN模块结构 B,1024,H/16,W/16
   [-1, 1, Conv, [256, 1, 1]], # 94 第二个检测 B,256,H/16,W/16

   [-1, 1, MP, []],   # B,256,H/32,W/32
   [-1, 1, Conv, [256, 1, 1]], # B,256,H/32,W/32
   [-3, 1, Conv, [256, 1, 1]], # B,256,H/16,W/16
   [-1, 1, Conv, [256, 3, 2]], # B,256,H/32,W/32
   [[-1, -3, 54], 1, Concat, [1]], #一起CAT B,256,H/32,W/32 和 B,256,H/32,W/32 和 B,512,H/32,W/32一起拼接成 B,1024,H/32,W/32

   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],  #第四个E-ELAN模块结构 B,2048,H/32,W/32
   [-1, 1, Conv, [512, 1, 1]], # 107  #第三个检测 B,512,H/32,W/32

   [81, 1, RepConv, [256, 3, 1]],
   [94, 1, RepConv, [512, 3, 1]],
   [107, 1, RepConv, [1024, 3, 1]],

   [[108,109,110], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
